DataMove/src/com/huawen/publishapp/data/webservice/xml/getStockDynPicEx.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <getStockDynPicEx xmlns="http://tempuri.org/">
      <StockCode>${StockCode}$</StockCode>
      <Market>${Market}$</Market>
      <AdditionalStockCode>${AdditionalStockCode}$</AdditionalStockCode>
      <AdditionalMarket>${AdditionalMarket}$</AdditionalMarket>
      <Width>${Width}$</Width>
      <Height>${Height}$</Height>
    </getStockDynPicEx>
  </soap:Body>
</soap:Envelope>